# Pandas <hr style="border:2.5px solid #10187dff"></hr>

<b>Tristan John Fortaleza</b>
<br>Computer Engineer

In [1]:
# Imports and packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Data Frame

In [2]:
# Creating dictionary
data = {
    "Name": ["Henry", "Owen", "Ada"],
    "Age": [22, 35, 58],
    "Sex": ["M", "M", "F"]
}

In [3]:
# Creating dataframe from dictionary
df = pd.DataFrame(data)
df

    Name  Age Sex
0  Henry   22   M
1   Owen   35   M
2    Ada   58   F

# Series

In [4]:
# Selecting "Name" column
df["Name"]

0    Henry
1     Owen
2      Ada
Name: Name, dtype: object

In [5]:
# Selecting "Age" column
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [6]:
# Selecting "Sex" column
df["Sex"]

0    M
1    M
2    F
Name: Sex, dtype: object

# Descriptive Statistics

In [7]:
# Jaguar vs Panther
resistance = np.array([
    [10.6, 9.1, 9.3, 9.8, 10.5, 10.4, 9.5, 11, 10.4, 3.9, 8],
    [10.1, 11, 9.1, 20, 9.2, 10.8, 9.9, 9.2, 9.1, 9.1, np.nan]
])

resistance

array([[10.6,  9.1,  9.3,  9.8, 10.5, 10.4,  9.5, 11. , 10.4,  3.9,  8. ],
       [10.1, 11. ,  9.1, 20. ,  9.2, 10.8,  9.9,  9.2,  9.1,  9.1,  nan]])

In [8]:
# Creating DataFrame from numpy array
df = pd.DataFrame(resistance.T, columns=['Jaguar', 'Panther'])
df

    Jaguar  Panther
0     10.6     10.1
1      9.1     11.0
2      9.3      9.1
3      9.8     20.0
4     10.5      9.2
5     10.4     10.8
6      9.5      9.9
7     11.0      9.2
8     10.4      9.1
9      3.9      9.1
10     8.0      NaN

In [9]:
# Summary of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Jaguar   11 non-null     float64
 1   Panther  10 non-null     float64
dtypes: float64(2)
memory usage: 308.0 bytes

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
# Summary of statistics
df.describe()

          Jaguar    Panther
count  11.000000  10.000000
mean    9.318182  10.750000
std     1.990386   3.329081
min     3.900000   9.100000
25%     9.200000   9.125000
50%     9.800000   9.550000
75%    10.450000  10.625000
max    11.000000  20.000000